content-org/all_posts.org
#+hugo_base_dir: ../
#+setupfile: ./setup.org
** TODO Things to do in New York and New Jersey.   :recommendations:vacation:
   :PROPERTIES:
   :EXPORT_FILE_NAME: nynj-vacation
   :END:
   :LOGBOOK:
   - Note taken on [2020-03-26 Thu 07:36] \\
     - Original note on <2019-05-27 Mon>
   :END:
*** TODO Sleep No More                                              :theater:
    :LOGBOOK:
    - State "TODO"       from              [2019-05-27 Mon 10:59]
    :END:
    - Off Broadway play in the Mckittrick Hotel.
    - Interactive theatre, the audience gets to be a part of the play.
*** TODO Infinity Hornblower                            :sights:skyline:boat:
    :LOGBOOK:
    - State "TODO"       from              [2019-05-27 Mon 11:00]
    :END:
    - Boozy Brunch on a boat
    - Perfect for a party and enjoying the skyline of New York
    - Ideal to pick the twilight ride, in order to enjoy both the day
      time and night time view of the skyline.
*** TODO Walk on the Brooklyn Bridge / Promenade.               :sights:free:
    :LOGBOOK:
    - State "TODO"       from              [2019-05-27 Mon 11:03]
    :END:
    - A free, wonderful walk. Great sights.
*** TODO Top of the Rock                                             :sights:
    :LOGBOOK:
    - State "TODO"       from              [2019-05-27 Mon 11:03]
    :END:
    - Pricey but beautiful view of New York (and especially Central
      Park) from the top of the Rockefeller building.
*** TODO Central Park                                                 :heart:
    :LOGBOOK:
    - State "TODO"       from              [2019-05-27 Mon 11:05]
    :END:
    - My favorite place in all of New York, and the one thing I'm
      genuinely jealous of NY citizen about. I wish Pune had such a
      place.
    - I need to visit this place multiple times
**** TODO Shakespeare in the park.                                  :theater:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:08]
     :END:
     - Shakespeare in the Park is a *free* performance of select
       Shakespeare plays performed by the Public Theater every day in
       Summer. This year, they are performing _Much Ado About Nothing_
       from May 21st to June 23rd.
     - The way to get tickets is to stand in line at the Delacorte
       Theater (open air theater inside Central Park) on the morning of
       the performance you want to attend. The tickets tend to run out
       by 10:30 am. The show is at 8 pm.
     - You need to register and create an account at the Public Theater
       here:
       https://publictheater.org/Programs--Events/Shakespeare-in-the-Park/register/.
       This gives you a Patron ID that you need when buying tickets.
*** TODO Free tour by foot                                             :free:
    :LOGBOOK:
    - State "TODO"       from              [2019-05-27 Mon 11:19]
    :END:
    - https://freetoursbyfoot.com/new-york-tours/
    - Excellent pay-what-you-wish tours.
    - There are a lot of categories for tours here. I'm most interested
      in the walking (sight-seeing) tours and food tours.
      + Greenwich Village Food Tour covers a bunch of very famous food
        stops.
*** Food Joints / Restaurants / Bars / Pubs / Speakeasies              :food:
**** TODO Smalls                                                       :jazz:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:36]
     :END:
     - Excellent Jazz club in Greenwich Village.
**** TODO Patent Pending                                          :speakeasy:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:32]
     :END:
     - Cool Speakeasy!
     - (I prefer Bathtub Gin)
**** TODO Bathtub Gin                                             :speakeasy:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:30]
     :END:
     - Speakeasy with Jazz and Burlesque performances
**** TODO Le Bain                                               :rooftop:bar:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:02]
     :END:
     - Amazing rooftop bar near the High Line.
     - Great views of New York.
     - Fancy and upscale place, dress in business casuals and shoes.
**** TODO Cafe China                           :michelin:finedine:restaurant:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:39]
     :END:
     - a Michelin Star restaurant for Chinese cuisine
**** TODO Roberta's Pizza                                             :pizza:
     :LOGBOOK:
     - State "TODO"       from              [2019-05-27 Mon 11:42]
     :END:
     - Superb Pizza place in Brooklyn
**** TODO The Counter                                                :burger:
     :LOGBOOK:
     - State "TODO"       from              [2020-01-25 Sat 22:21]
     :END:
     - Superb burgers

