content/blog/nynj-vacation.md
+++
title = "Things to do in New York and New Jersey."
author = ["Vedang Manerikar"]
lastmod = 2020-03-26T07:37:10+05:30
tags = ["recommendations", "vacation"]
categories = ["random"]
draft = true
creator = "Emacs 26.1 (Org mode 9.3.2 + ox-hugo)"
+++

## <span class="org-todo todo TODO">TODO</span> Sleep No More {#sleep-no-more}

-   Off Broadway play in the Mckittrick Hotel.
-   Interactive theatre, the audience gets to be a part of the play.


## <span class="org-todo todo TODO">TODO</span> Infinity Hornblower {#infinity-hornblower}

-   Boozy Brunch on a boat
-   Perfect for a party and enjoying the skyline of New York
-   Ideal to pick the twilight ride, in order to enjoy both the day
    time and night time view of the skyline.


## <span class="org-todo todo TODO">TODO</span> Walk on the Brooklyn Bridge / Promenade. {#walk-on-the-brooklyn-bridge-promenade-dot}

-   A free, wonderful walk. Great sights.


## <span class="org-todo todo TODO">TODO</span> Top of the Rock {#top-of-the-rock}

-   Pricey but beautiful view of New York (and especially Central
    Park) from the top of the Rockefeller building.


## <span class="org-todo todo TODO">TODO</span> Central Park {#central-park}

-   My favorite place in all of New York, and the one thing I'm
    genuinely jealous of NY citizen about. I wish Pune had such a
    place.
-   I need to visit this place multiple times


### <span class="org-todo todo TODO">TODO</span> Shakespeare in the park. {#shakespeare-in-the-park-dot}

-   Shakespeare in the Park is a **free** performance of select
    Shakespeare plays performed by the Public Theater every day in
    Summer. This year, they are performing <span class="underline">Much Ado About Nothing</span>
    from May 21st to June 23rd.
-   The way to get tickets is to stand in line at the Delacorte
    Theater (open air theater inside Central Park) on the morning of
    the performance you want to attend. The tickets tend to run out
    by 10:30 am. The show is at 8 pm.
-   You need to register and create an account at the Public Theater
    here:
    <https://publictheater.org/Programs--Events/Shakespeare-in-the-Park/register/>.
    This gives you a Patron ID that you need when buying tickets.


## <span class="org-todo todo TODO">TODO</span> Free tour by foot {#free-tour-by-foot}

-   <https://freetoursbyfoot.com/new-york-tours/>
-   Excellent pay-what-you-wish tours.
-   There are a lot of categories for tours here. I'm most interested
    in the walking (sight-seeing) tours and food tours.
    -   Greenwich Village Food Tour covers a bunch of very famous food
        stops.


## Food Joints / Restaurants / Bars / Pubs / Speakeasies {#food-joints-restaurants-bars-pubs-speakeasies}


### <span class="org-todo todo TODO">TODO</span> Smalls {#smalls}

-   Excellent Jazz club in Greenwich Village.


### <span class="org-todo todo TODO">TODO</span> Patent Pending {#patent-pending}

-   Cool Speakeasy!
-   (I prefer Bathtub Gin)


### <span class="org-todo todo TODO">TODO</span> Bathtub Gin {#bathtub-gin}

-   Speakeasy with Jazz and Burlesque performances


### <span class="org-todo todo TODO">TODO</span> Le Bain {#le-bain}

-   Amazing rooftop bar near the High Line.
-   Great views of New York.
-   Fancy and upscale place, dress in business casuals and shoes.


### <span class="org-todo todo TODO">TODO</span> Cafe China {#cafe-china}

-   a Michelin Star restaurant for Chinese cuisine


### <span class="org-todo todo TODO">TODO</span> Roberta's Pizza {#roberta-s-pizza}

-   Superb Pizza place in Brooklyn


### <span class="org-todo todo TODO">TODO</span> The Counter {#the-counter}

-   Superb burgers
